{
	"Astronomy": {
		"Astrohunt": {
			"coordinators": [
				{
					"coordinator_name": "Varsha",
					"coordinator_number": "+91 89296 50849"
				},
				{
					"coordinator_name": "Himanshu",
					"coordinator_number": "+91 86076 89591"
				},
				{
					"coordinator_name": "Vishwas Yogi",
					"coordinator_number": "+91 75658 32926"
				}
			],
			"description": "The universe has immense knowledge. Right from ever burning sun to numerous\nconstellations,it never ceases to amaze us. So can you couple your knowledge on\nastronomy with your mental prowess.Do you have it in you? If yes, then this is the place\nwhere you need to be.\nAstronomy quiz is a 2-membered team event where the participants will be judged on the\nbasis of their knowledge of Astronomy and related fields. The quiz consists of various\nrounds, each prompting the players to use their skills to decode or find the answers.\n\n",
			"document": "https://chat.whatsapp.com/JK4PPmrMWK1BqE0T28aR1r",
			"endTime": 1713141000000,
			"eventCategory": "Astronomy",
			"eventName": "Astrohunt",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649528054/techspardha/events/IMG-20220407-WA0000_wazydg.jpg",
			"rules": [
				"Participants are allowed to ask the coordinator for hints, but sharing answers with other teams isn't allowed.",
				" Participants are free to use any resource available to them to solve the mysteries.",
				" Winners will be declared on the basis of the leaderboard ranks of the teams.",
				"There will be no elimination round for the event, and no elimination of the teams during the event.",
				"Maximum 3 members per team."
			],
			"startTime": 1713132000000,
			"venue": "Online 2"
		},
		"Astronomy Quiz": {
			"coordinators": [
				{
					"coordinator_name": "Shivam ",
					"coordinator_number": "+91 97291 22369"
				},
				{
					"coordinator_name": "Vishwas Yogi",
					"coordinator_number": "+91 75658 32926"
				},
				{
					"coordinator_name": "Rishabh Goyal",
					"coordinator_number": "+91 80595 80634"
				}
			],
			"description": "The universe has immense knowledge. Right from ever burning sun to numerous constellations, it never ceases to amaze us. So, can you couple your knowledge on astronomy with your mental prowess. Do you have it in you? If yes, then this is the place where you need to be.\n\nAstronomy quiz is a 2-membered team event where the participants will be judged on the basis of their knowledge of Astronomy and related fields. The quiz consists of various rounds, each prompting the participants to dive through the depths of cosmos and unlocking its secrets.\nRegister Here: https://docs.google.com/forms/d/e/1FAIpQLSeSYJqdqKmdCe6bAHL6H5yKG95juNevLX480wGueZB08akEhw/viewform?usp=sf_link",
			"document": "https://chat.whatsapp.com/JIzFA264NHG6f9eRUdeDsk",
			"endTime": 1708234200000,
			"eventName": "Astronomy Quiz",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649306591/techspardha/events/astroquiz_bmwcm3.jpg",
			"rules": [
				"If any dispute occurs, the quiz master will have final say on the matter and his verdict cannot be objected under any circumstances.",
				"The Final round, the selected teams will take part in an audio-visual round answering questions on astronomy.",
				"The Elimination round will be an Online quiz (objective+short answer) round. It would need you to answer 20-25 questions within a limited time period based on anything and everything from the world of astronomy.",
				"The event will be held in 2 main rounds.",
				"Two members per team."
			],
			"startTime": 1708138800000,
			"venue": "Electrical Department"
		},
		"Astrostorm": {
			"coordinators": [
				{
					"coordinator_name": "Harshita",
					"coordinator_number": "+918295312927"
				},
				{
					"coordinator_name": "Poorna Siva",
					"coordinator_number": "8555096237"
				}
			],
			"description": "Astrostorm presents you the opportunity to take your knowledge of astronomy and fuse it with your funky artistic mind to create a modern masterpiece that is ready to be published by any global magazine and good enough to attract even the most disinterested ones.\nIt will be a single day event and the participant will have to submit either a digital or a handmade magazine styled pamphlet that may include designs fused with articles and all the other stuff that you may want. Creativity is the key!!!\n\nSend your entries at: antarikshnitkkr@gmail.com\nRegister Here:  https://docs.google.com/forms/d/e/1FAIpQLSehPo62qJPa55XXj75FI1sY_nCE3G1yU4UMuxhTDcQu4Pf6sw/viewform?usp=sf_link",
			"document": "https://chat.whatsapp.com/JsEgSztBOZeDdXIG8PLnXl",
			"endTime": 1650184200000,
			"eventName": "Astrostorm",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649306614/techspardha/events/astrostorm_gps6g2.jpg",
			"rules": [
				"This is a single player event.",
				"There is only one stage to it.",
				"Entries can be submitted as a handwritten pamphlet  or a digital design.",
				"Those who submit the handwritten art must use an A4 sheet.",
				"The graphic design should be an A4 size printable document.",
				"The judges have the right to ask for the .PSD file of your digital pamphlet.. ",
				"➔\tPhotos (2-3) must be taken during painting/ sketching/ designing and attach with the submission as a proof."
			],
			"startTime": 1650164400000,
			"venue": "Electrical Department"
		},
		"Impressum": {
			"coordinators": [
				{
					"coordinator_name": "Baldev Kumar",
					"coordinator_number": "+91 80595 80634"
				},
				{
					"coordinator_name": "Harshita",
					"coordinator_number": "+918295312927"
				}
			],
			"description": "Impressum provides you with a platform to showcase your mastery in painting or digital art as you create a masterpiece depicting the heavens.\nArtwork should be related to cosmos and can be submitted in any form, i.e., painting/sketching or digital art.\n\nSend your entries at: antarikshnitkkr@gmail.com\nRegister Here: https://docs.google.com/forms/d/e/1FAIpQLSeeW3i2Ki4ylsWC5cl6Jw64TAYWyxIRlkor_2vs8nsbsGXE2w/viewform?usp=sf_link",
			"document": "https://chat.whatsapp.com/LFUDyIqk8692uBQ6jtOF17",
			"endTime": 1650094200000,
			"eventName": "Impressum",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649528136/techspardha/events/IMG-20220409-WA0003_fm1flb.jpg",
			"rules": [
				"Entries to submitted to antarikshnitkkr@gmail.com",
				"Decision of the judging authority will be final and abiding.",
				"Photos (2-3) must be taken during different stages of painting/ sketching/ designing and to be attached with the submission as a proof. ",
				"The judges have the right to ask for the .PSD file of your digital drawing/design. ",
				"The graphic design should be an A3 size printable document",
				"The painting or sketch should be made on an A3 size sheet and you are free to use any type of colours.",
				"Entries can be submitted as a painting/sketch or a digital design.",
				"Single member event."
			],
			"startTime": 1650083400000,
			"venue": "Electrical Department"
		},
		"Water Rocket ": {
			"coordinators": [
				{
					"coordinator_name": "Rishabh Goyal",
					"coordinator_number": "+91 80595 80634"
				},
				{
					"coordinator_name": "Sarita Kashyap",
					"coordinator_number": "+919899108624"
				},
				{
					"coordinator_name": "Baldev Kumar",
					"coordinator_number": "+91 80595 80634"
				}
			],
			"description": "Event Description\n\nSettings a Rocket's tail on fire is not the only way to launch it. Blast off your rocket using simple methods into the limitless blues.\n\nProblem Statement\n\nDesign and Build a water rocket which can be launched vertically and at multiple angle with respect to the horizontal and should be accurate. There will be two rounds and winners will be decided according to rules given below.\n \nDesign Specifications\n\nOnly plastic soft drink bottles are to be used for the rocket body.\nOnly tap water provided during the events can be used while launching the rocket.\nMultistage and booster rockets can be used.\nPump will be provided by the organizers.\nRocket must be launched from a stationary position on a fixed launcher. (Slingshots, trebuchets, catapults, cannons, and all other forms of launcher boost assists are forbidden). In other words, the internal pressure of the rocket must be the only source of energy for the rocket.\nThe amount of water to be filled in the rocket body is left to the choice of the team.\nThe rocket must handle minimum pressure of 80 psi.\nThe launch pressure is fixed up-to 70 psi and the exact pressure will be decided later.\nThe team with launcher attachment which can launch rocket at multiple angle will be awarded extra points.\n",
			"document": "https://chat.whatsapp.com/LrfGEZfpuMR5FEz4fSblbG",
			"endTime": 1650105000000,
			"eventName": "Water Rocket ",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649528168/techspardha/events/IMG-20220409-WA0002_suabgb.jpg",
			"rules": [
				"Team Size: A team for Water Rocket Challenge can have a maximum of 2 members.",
				"Burst Testing: All rockets will be tested to a pressure of 80 psi before they can be allowed to enter the competition. Teams are therefore advised to test their rockets to a pressure of 80 psi beforehand and also bring substitute rockets with them.",
				"If a team's rocket fails the Burst Test, ONLY ONE extra rocket shall be allowed to be burst tested. If that rocket fails the burst test too, then no points will be awarded to the team.",
				"Once a rocket passes the burst test, it shall be allowed only one attempt for launch.The rules are subject to change. In case of disputes, the decision of team Water Rocket Challenge is final and binding."
			],
			"startTime": 1650081600000,
			"venue": "Sports Complex"
		},
		"Zathura": {
			"coordinators": [
				{
					"coordinator_name": "Jayesh ",
					"coordinator_number": "+916377599026"
				},
				{
					"coordinator_name": "Poornashiva ",
					"coordinator_number": "8555096237"
				}
			],
			"description": "Embark on the ultimate space adventure and make your way through the deepest mysteries of the universe to reach the final frontier: ZATHURA.\nOnce chosen you must complete the tasks that the game has to offer, for the fate of the universe hangs in the balance. To get on the spaceship and pull the thrusters, you must take the assistance of another member. So get ready for this exciting adventure!\nA game for those who seek to find a way to leave their world behind.\nRegister Here: https://docs.google.com/forms/d/e/1FAIpQLSfRuneE8RUkW7GzKukw9Wk2OvA6c2gqcLC2LEaLPatrKSnLdQ/viewform?usp=sf_link",
			"document": "https://chat.whatsapp.com/K8HqsUY4ord3a9RCBBC3RM",
			"endTime": 1650011400000,
			"eventName": "Zathura",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649528189/techspardha/events/IMG-20220409-WA0016_hflcfj.jpg",
			"rules": [
				"Rules of the board game will be explained at the final event only.",
				"Six teams will be selected after the elimz to play the board game in online format..",
				"Elimz will be an online objective quiz round and the problems will be based on knowledge of basic physics and astronomy.",
				"The event will be held in 2 rounds- Elimz and Finals",
				"Two players per team."
			],
			"startTime": 1649995200000,
			"venue": "ED Hall"
		}
	},
	"Design": {
		"3D Integration": {
			"coordinators": [
				{
					"coordinator_name": "Divya",
					"coordinator_number": "9458153120"
				},
				{
					"coordinator_name": "Nakul",
					"coordinator_number": "8890026163"
				}
			],
			"description": "3D integration includes the process of making 3-D designs of mechanical parts, assemblies simulations using computer software. These include industries from aerospace and defense, automotive, and industrial equipment, to high-tech, shipbuilding, architecture and construction, process power, and petroleum and services.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650079800000,
			"eventName": "3D Integration",
			"flagship": "false",
			"poster": "https://i.ibb.co/GJG9X8X/db32drs7o0busf12ftir.png",
			"rules": [
				"Single member event, Participants can bring their own laptop to the final event"
			],
			"startTime": 1649766600000,
			"venue": "CAD Lab"
		},
		"Art Icon": {
			"coordinators": [
				{
					"coordinator_name": "Sahil",
					"coordinator_number": "9717145833"
				},
				{
					"coordinator_name": "Mahesh",
					"coordinator_number": "8950582396"
				}
			],
			"description": "Art Icon is a graphic designing competition where we check the skills of participants in photoshop through various rounds . Participants are required to make a poster on given topic under a time limit using maximum tools of photoshop . The best poster wins the event",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650099600000,
			"eventName": "Art Icon",
			"flagship": "false",
			"poster": "https://i.ibb.co/X8C22Wt/bv3zrppczmbfqwqulcjc.png",
			"rules": [
				"Plagiarism will lead to disqualification.",
				"Any editing software can be used: Preferred: Adobe Photoshop, Corel Draw, Illustrator can be used for better results. ",
				"Each participant can send only one entry in each category. ",
				"There are two categories: •Poster Designing (Theme Spectrum of innovation) •Composition ( Magical Reflection) (One Winners will be selected from each of the above categories.) ",
				"There will be elimination round as well to check the ability of participant."
			],
			"startTime": 1649853000000,
			"venue": "CAD Lab"
		},
		"Build'emall": {
			"coordinators": [
				{
					"coordinator_name": "Veerender",
					"coordinator_number": "9680780639"
				},
				{
					"coordinator_name": "Bhavana",
					"coordinator_number": "9848226323"
				},
				{
					"coordinator_name": "Sahil",
					"coordinator_number": "930615692"
				}
			],
			"description": "Use Your Creativity and technical skill to build any model of Civil Engineering structure.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSdmfMtgM8Y1GYbwERCKE_1FV_-DhahqZw08Cbdy6OXLaxxvvw/closedform",
			"endTime": 1674889200000,
			"eventName": "Build'emall",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha5/image/upload/v1674726243/techspardha22/events/xcbk4uwgfaf2i64lbzkg.png",
			"rules": [
				"• No extra materials (tape, nails, etc.) should be entertained in the structure.",
				"• Winner will be decided on the basis of maximum load bearing capacity and ratio of failure load to  dead load of dome. Special reward will be given to the innovative design so sure that your design is innovative and safe.",
				"• The testing will be done by applying concentrated load in the middle of the cable suspension bridge (cracking of any joint, sudden collapse or instability will be considered as failure)."
			],
			"startTime": 1674880200000,
			"venue": "C-103"
		},
		"Cad Pro": {
			"coordinators": [
				{
					"coordinator_name": "Vennela ",
					"coordinator_number": "8688032221"
				},
				{
					"coordinator_name": "Manideep",
					"coordinator_number": "9550679106"
				}
			],
			"description": "The participants will have to make a design model by using the software STAAD-Pro, and Auto CAD to predict the various reactions that may act on the structure.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSe2c8-vr3LDUeDMXtsulV-dUdcLl6A6D4csXY7InOpZS4FhxA/viewform",
			"endTime": 1674905400000,
			"eventName": "Cad Pro",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha5/image/upload/v1674726021/techspardha22/events/h1dgdpu74wkglmzopdbo.png",
			"rules": [
				"All UG and PG are allowed to participate",
				"Last date of submission is 28 Jan 2023",
				"Planning should be in AutoCAD and Design should be in STAAAD PRO.",
				"• Double member event."
			],
			"startTime": 1674898200000,
			"venue": "Civil department"
		},
		"Contraption": {
			"coordinators": [
				{
					"coordinator_name": "Mahesh",
					"coordinator_number": "8950582396"
				},
				{
					"coordinator_name": "Sahil",
					"coordinator_number": "9717145833"
				}
			],
			"description": "“The art of simplicity is a puzzle of complexity”\nParticipants have to build their way up to create intricate mechanisms from simple stuffs. Design mechanisms using energy conversions to perform certain given tasks.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650108600000,
			"eventName": "Contraption",
			"flagship": "true",
			"poster": "https://i.ibb.co/vjqWDX8/p4gqtlny2uranqmbqxmg.png",
			"startTime": 1649502000000,
			"venue": "ED Hall"
		},
		"High Sky": {
			"coordinators": [
				{
					"coordinator_name": "Chaitanya",
					"coordinator_number": "9370745920"
				},
				{
					"coordinator_name": "Ritvik",
					"coordinator_number": "8708907602"
				},
				{
					"coordinator_name": "Mandeep",
					"coordinator_number": "7206167114"
				},
				{
					"coordinator_name": "Shemon",
					"coordinator_number": "8766348552"
				}
			],
			"description": "The event involves design and fabrication of an RC aircraft with good gliding characteristics. It’s a 5 member team event. The event provides a platform for the participants to showcase their designing and analytical skills. It gives an opportunity to have an essence of what it takes to build an airplane, the basics of flight mechanics and what role do the individual components of an aircraft play in keeping it airborne with perfect stability. Moreover, Highsky gives a comprehensive insight into the RC hobby world as the participants will come to\nknow about the practical aspects of handling transmitters and electronics like receivers, servo motors etc.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSdp8UActMxpQI8h722DH9q4X7Q8daaWNwIAnQ_tFbF47mGrsQ/viewform",
			"endTime": 1650092400000,
			"eventName": "High Sky",
			"flagship": "true",
			"poster": "https://i.ibb.co/R9HWtJW/lqq6e9h0kxihie32wiim.jpg",
			"rules": [
				" Each team must consist of minimum 4 and maximum 6 members. They need not be from the same institute.",
				"There can be more than one team from the same institute",
				"Usage of readymade kits is not allowed. However, readymade motors, actuators and propellers can be use",
				" The participants have to use the same model throughout the event.",
				"Minor changes may be made in case there is a damage",
				" A permanent breakdown of the plane would lead to disqualification of that particular team",
				" Maximum thrust/weight (t/w) ratio is limited to 1.",
				" Maximum weight of the RC plane is restricted to 800gm.",
				"The maximum wingspan is limited to 100cm.",
				". All the systems like servos, motors etc. would be checked at the time of the event. The team may be disqualified if found faulty.",
				"Decisions taken by the judges and event coordinators would be final.",
				"The coordinators have the right to disqualify a team if they are found violating the above rules or missing the deadlines."
			],
			"startTime": 1650078000000,
			"venue": " Sports Ground"
		},
		"Hover race": {
			"coordinators": [
				{
					"coordinator_name": "Pushkal Shukla",
					"coordinator_number": "9729461168"
				},
				{
					"coordinator_name": "Sahil",
					"coordinator_number": "7496899505"
				},
				{
					"coordinator_name": "Sanjeev",
					"coordinator_number": "8586953016"
				},
				{
					"coordinator_name": "Navdeep",
					"coordinator_number": "9728007812"
				},
				{
					"coordinator_name": "Sheru",
					"coordinator_number": "9521533947"
				}
			],
			"description": "Hovercraft is a vehicle which floats on an air cushion and has a separate propulsion mechanism for the forward/ backward movement.\nIt’s a 5 member team event.This event requires participants to design and fabricate a hovercraft which they would have to race through an arena. The team which completes two laps of the arena in minimum time would be declared as the winner. The arena would consist of slopes and turns and different types of terrain which the hovercraft is capable of being operated on.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSeNmNWxOC4GqCHjFFMUdBCYORIU5hNFEyxeLHIHOCId08dSjw/viewform",
			"endTime": 1650178800000,
			"eventName": "Hover race",
			"flagship": "true",
			"poster": "https://i.ibb.co/C2gp7jH/qc3vaoplcstxe97rpf9d.jpg",
			"rules": [
				"Each team must consist of 5 members. They need not be from the same institute.",
				"There can be more than one team from the same institute.",
				"Usage of readymade kits is not allowed. However, readymade motors, actuators and propellers can be used.",
				"The participants have to use the same model throughout the event.",
				"Minor changes may be made in case there is a damage.",
				"A permanent breakdown of the hovercraft would lead to disqualification of that particular team.",
				"The model can be fabricated using foam, wood or coroplast.",
				"The coordinators have the right to disqualify a team if they are found violating the above rules or missing the deadlines."
			],
			"startTime": 1650164400000,
			"venue": "ED Hall"
		},
		"Junkyard Wars": {
			"coordinators": [
				{
					"coordinator_name": "Keshav",
					"coordinator_number": "8755503131"
				},
				{
					"coordinator_name": "Pratham",
					"coordinator_number": "8059860771"
				}
			],
			"description": "Junkyard Wars is an event which makes blend of your creativity, engineering concepts and skills to create working models using junk. So gear up with your design skills and get ready for this ultimate challenge. \n\tThe goal of this competition is to construct a quad-cycle or tricycle vehicle which is driven by Human Power. However there are points based on the design criterion.\n\tVehicle should be mounted with any Firing Mechanism i.e. Slingshot, Catapult, Crossbow, etc. having mobility of rotation about Horizontal and Vertical Axis and should be able to hit the given target present any side of the vehicle. Aiming mechanism shall be manual.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650180600000,
			"eventName": "Junkyard Wars",
			"flagship": "true",
			"poster": "https://i.ibb.co/g9BdcpY/t36hxquldvokrzqdxdj9.png",
			"rules": [
				"The Judges and the Event Coordinators have the right to disqualify the teams in case of any misconduct. ",
				"Junkyard Wars is not responsible for any loss of property, injury and delays caused by participants during the event.",
				"Participants must comply with the rules of the Work area where the model will be built.",
				"Teams are restricted to use any material apart from the available junk they are allotted with the permission of Event Coordinator.",
				"Teams are restricted to use any material apart from the available junk they are allotted with the permission of Event Coordinator.",
				"All teams are expected to have a prior knowledge on the use of cutting and drilling devices that includes hacksaws, chisel, drilling kit etc.",
				"All the team members must be present during the finals",
				"Each team should consist of maximum 5 members only"
			],
			"startTime": 1650174071000,
			"venue": "Academic Block"
		},
		"LAY YOUR PLAN": {
			"coordinators": [
				{
					"coordinator_name": "Piyush",
					"coordinator_number": "7023678303"
				},
				{
					"coordinator_name": "ISHI",
					"coordinator_number": "9599097799"
				}
			],
			"description": "This event mainly focuses on plant layout and material handling skills to employ in a problem statement to be released during the final round of the event. Participants are required to lay their plan on a given problem under a time limit using their analytical-numerical computational plant layout and material handling skills. It will induce plant managerial skills into a student aimed at the deployment of plant resources in an optimized area.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650000600000,
			"eventName": "LAY YOUR PLAN",
			"flagship": "true",
			"poster": "https://i.ibb.co/k9g2x89/nbmmsfbxhth2lyahpuyk.png",
			"rules": [
				"Orientation would be extensively done and is must to be attended by all team members of selected students.",
				" Written test would be of 15-30 minutes.",
				"Maximum of 3 member of team."
			],
			"startTime": 1649764800000,
			"venue": "Conference Room, Mechanical Department"
		},
		"Machinability": {
			"coordinators": [
				{
					"coordinator_name": "Priyanshu",
					"coordinator_number": "9935500361"
				},
				{
					"coordinator_name": "Nakul",
					"coordinator_number": "8890026163"
				}
			],
			"description": "Mechanical Engineering is nothing without the knowledge of Machines, its parts, its processes and Manufacturing. It is a skill that we get with experience from the practical and experiments. The application of that knowledge and skill to create, innovate, build, analyze, design and manufacture things in such a way that the product meets the sole purpose of its manufacturing.\nMachinability is designed in such a way that it tests your knowledge and skills at the very core of Mechanical Engineering. It gives an opportunity to unfurl a student's innovative mind so be ready to be a true and unique Mechanical Engineer in a race where you will get a great platform to compete with the best minds out there.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650011400000,
			"eventName": "Machinability",
			"flagship": "false",
			"poster": "https://i.ibb.co/HHZJ9Rd/ffopsb3bmyzftufdlugn.png",
			"rules": [
				"Every round in this event will be in Google meet platform only. Check your app availability in mobile/ browser on pc with a decent internet connectivity.",
				"Maximum of 2 people per Team are allowed. Even a single person team is accountable/ acceptable.Maximum of 2 people per Team are allowed. Even a single person team is accountable/ acceptable."
			],
			"startTime": 1649763000000,
			"venue": "Workshop"
		},
		"Mixcrete": {
			"coordinators": [
				{
					"coordinator_name": "Shivam",
					"coordinator_number": "6393895959"
				},
				{
					"coordinator_name": "Mohit",
					"coordinator_number": "7424960883"
				},
				{
					"coordinator_name": "Akashdeep",
					"coordinator_number": "9813246434"
				}
			],
			"description": "Civil engineering is all about practical skills and day-to-day calculations, so apply these skills in correct proportions to cast a concrete cube.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLScBbhS-o-2skcIFgzfNuVQIw--Wm-wE0Xc2J5_DhfuuX7uglg/closedform",
			"endTime": 1674811800000,
			"eventName": "Mixcrete",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha9/image/upload/v1674751208/techspardha22/events/zrf1xlfgg9kdndpqxgid.jpg",
			"rules": [
				"2 Member event , All UG and PG eligible",
				"Material will be provided in the lab",
				"Judging will be done on the basis of average strength"
			],
			"startTime": 1674801000000,
			"venue": "Concrete lab"
		},
		"Planning and Designing": {
			"coordinators": [
				{
					"coordinator_name": "Shobith",
					"coordinator_number": "7087869971"
				},
				{
					"coordinator_name": "Anushika",
					"coordinator_number": "9717344274"
				},
				{
					"coordinator_name": "Mitbash",
					"coordinator_number": "8690061503"
				}
			],
			"description": "The representation of a particular area, considering its physical features, cities, roads, etc..is called a map. In today's scenario, we all are used to developing and always want to renovate past ideas by adding something new. Digital Map is such, come into use these days. Putting forward this and developing this skill, \"INFRASTRUCTURE SOCIETY\" came up with the \"Planning and Designing\" event. This basically deals with the preparation of a Digital Map of the campus.",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLScKFnkOm_FWrJa_RzM9j1B35fRU1VfD58C8AcTrOF4t4ymy_w/viewform",
			"endTime": 1674817200000,
			"eventName": "Planning and Designing",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha9/image/upload/v1674750377/techspardha22/events/foapa4zgtquod8xs48hd.jpg",
			"rules": [
				"Designing should be in Sketchup pro",
				"Two-Four Member Event, All UG and PG are eligible"
			],
			"startTime": 1674811800000,
			"venue": "Civil Department"
		},
		"Roll A Coaster": {
			"coordinators": [
				{
					"coordinator_name": "Tarun",
					"coordinator_number": "902722234"
				},
				{
					"coordinator_name": "Ayush",
					"coordinator_number": "8383842799"
				}
			],
			"description": "Roller Coasters are called \"Gravity Rides\" for a good reason. Once the coaster has been dragged to the top of the first hill and released, it is the force of gravity that keeps the coaster going, all the way back to the station platform at the end of the ride. As the coaster goes through its twists, turns, rolls and loops, it gains and loses its initial potential energy(supplied dragging it up the first hill).\nDesign and fabricate your dream Roll-A-Coaster ride. An abstract (containing the detailed design) needs to be submitted to the undersigned initially upon whose approval the actual fabrication can begin.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650022200000,
			"eventName": "Roll A Coaster",
			"flagship": "false",
			"poster": "https://i.ibb.co/Tr2th7g/n0pjvprs1lcnck9ce74h.png",
			"rules": [
				"The height of the model must not exceed above 1.5m",
				"The overall track must fit into a rectangular footprint of 0.75m * 1.2m",
				"Maximum of 4 and minimum of 3 members are allowed per team."
			],
			"startTime": 1649505600000,
			"venue": "ED Hall"
		},
		"THINK INDIA": {
			"coordinators": [
				{
					"coordinator_name": "Mantavya Vashishta",
					"coordinator_number": "9784825484"
				},
				{
					"coordinator_name": "Khushboo",
					"coordinator_number": "9057184639"
				}
			],
			"description": "A platform for those who always think of resolving the social problems and provide everyone with all the basic needs.",
			"document": "",
			"endTime": 1606545000000,
			"eventName": "THINK INDIA",
			"flagship": "false",
			"poster": "https://i.ibb.co/JrstJKT/Think-India.jpg",
			"rules": ["Three member event."],
			"startTime": 1605925800000,
			"venue": "https://surveyheart.com/form/5fb8e5529afeb570cbee26e0"
		},
		"VIDHWAAN": {
			"coordinators": [
				{
					"coordinator_name": "Nitin ",
					"coordinator_number": "8930492096"
				},
				{
					"coordinator_name": "Rajendra ",
					"coordinator_number": "9636031076"
				},
				{
					"coordinator_name": "Yaman ",
					"coordinator_number": "8168401837"
				},
				{
					"coordinator_name": "Bhavesh ",
					"coordinator_number": "7062019982"
				}
			],
			"description": "An event exclusively for those who are highly interested in electrical core, includes concepts like generation, transmission and distribution. Participants will be designing the power grid that consists of the generating stations, substations with the protection devices.\n",
			"document": "",
			"endTime": 1650177000000,
			"eventName": "VIDHWAAN",
			"flagship": "true",
			"poster": "https://i.ibb.co/ph3VhsV/pfbpiemi5vy5uaujvsup.jpg",
			"rules": ["It is a team event."],
			"startTime": 1648866600000,
			"venue": "Electrical Department"
		}
	},
	"Informals": {
		"GameAThon": {
			"coordinators": [
				{
					"coordinator_name": "Harshvardhan",
					"coordinator_number": "7909081798"
				},
				{
					"coordinator_name": "Vaibhav",
					"coordinator_number": "8239307242"
				}
			],
			"description": "Hey everyone!✨\n\nTired of your hectic schedule? \nNow it's time to get some solace,\nTechspradha'22\nbrings you GAMEATHON🤩🥳\nAn online gaming event!\n\nIt's time to show your presence of mind as well as power of reflexes along with 200IQ gameplay🌚💪🏻\n\nJoin in our flagship games :\n\n👉 BGMI(You can also register as solo,duo,trio or squad but it will be a squad event!)\n👉 CHESS(Solo)\n\nSit right at your place and showcase your gaming skills😌\n💰 Win prize worth ₹10,000💰",
			"document": "https://forms.gle/yo2qrJ5gR3TAmXW1A",
			"endTime": 1674995400000,
			"eventName": "GameAThon",
			"flagship": "false",
			"poster": "https://i.ibb.co/dgp17s8/IMG-20230118-WA0007.jpg",
			"rules": ["Rules of respective games will be enforced."],
			"startTime": 1674790200000,
			"venue": "Online"
		},
		"Gamestation": {
			"coordinators": [
				{
					"coordinator_name": "Shahid",
					"coordinator_number": "9793401591"
				},
				{
					"coordinator_name": "Pransu",
					"coordinator_number": "8953478310"
				}
			],
			"description": " Brace yourselves for Nitkkr's gaming extravaganza – GameStation 2024!👨🏻‍💻 Embark on a virtual adventure 🤩 starting from March 14th, where the pixels come alive and competition ignites 🤖. It's not just an esports event; it's a celebration of skills, strategy, and sheer gaming passion. Whether you're a seasoned player or a casual gamer, this is your arena 🎯. Join us for a gaming odyssey that transcends screens and sparks excitement 💻. Unleash your competitive spirit, forge new alliances, and claim victory 🏆 in the biggest esports event on the horizon 👑.\n\n📅 Dates: 14th to 17th March\n📍Venue: ED Hall\n\nSave the date, power up your consoles 🎮 , and let the games begin",
			"document": "https://docs.google.com/forms/d/1vsca_DjRoi7i9AtGvm42XMRxhCzqnH0n_k7CVghDbVM/edit",
			"endTime": 1710642600000,
			"eventCategory": "Informals",
			"eventName": "Gamestation",
			"flagship": "false",
			"poster": "https://i.ibb.co/3NB8z2M/blob.jpg",
			"rules": ["Rules of respective games will be enforced"],
			"startTime": 1710387000000,
			"venue": "ED Hall"
		},
		"MICRO INNOVATOR ": {
			"coordinators": [
				{
					"coordinator_name": "Shubham",
					"coordinator_number": "8950113509"
				},
				{
					"coordinator_name": "Bhavya",
					"coordinator_number": "9306372595"
				}
			],
			"description": "1. The teams have to present an innovative working model which will be judged by the teachers and the student judges. \n2. The working model can be hardware or software-based. \n3. The teams need to present their idea in the form of a PowerPoint presentation in case of \nthe unavailability of a working model. \n",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/micro+innovator.pdf",
			"endTime": 1650000600000,
			"eventName": "MICRO INNOVATOR ",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649531054/techspardha/events/micro_innovator_uakd5f.png",
			"rules": [
				"ABSTRACT SUBMISSION: The entire idea and the details of the working model should be explained in the abstract with the help of diagrams and all the abstracts must be sent to the below mentioned Email address with the name of the abstract file as MICROINNOVATOR_ (Project Title). ",
				"JUDGING CRITERIA: The teams will be judged on the basis of following criterion like-  Innovation of the project, Strategy and planning, Uniqueness of the idea, Usefulness of the idea and Presentation and project report. ",
				"TEAM SPECIFICATIONS: A team of 3 members is allowed and the team members should decide a team representative. ",
				"You can register by sending your team detail, idea details and abstract on microinnovator22@gmail.com"
			],
			"startTime": 1649991600000,
			"venue": "L - Block"
		},
		"Treasure Hunt": {
			"coordinators": [
				{
					"coordinator_name": "Muskan",
					"coordinator_number": "7011872139"
				},
				{
					"coordinator_name": "Shivangi ",
					"coordinator_number": "7309914283"
				}
			],
			"description": "Do you think you know your campus ?Well let's find out ,come join us in this fun and adventurous event we have brought up for you .\nNot all treasure is silver and gold mate ,but it can be far more exciting than that.\nSo gather your mates and participate in this hunt which can lead you to a lotta exciting prizes and heap up your cash collection.\n\nPro tip:No skills required despite just your team being a little sassy and massy.😜🥳\nThe event will have two quirky rounds.\n1.  In round 1 we have given a new twist to the traditional dumb charades which you'll  find worth your while.\n2.  About round 2 ,you'll know when you get there as  some things better be a secret.",
			"document": "https://forms.gle/MXR8zpis4P34qX2G9",
			"endTime": 1650180600000,
			"eventName": "Treasure Hunt",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649938336/techspardha/events/IMG-20220411-WA0008_zygicx.jpg",
			"rules": [
				"You can register via the app as well as with the link of the Google form provided .",
				"Registration is required in a team of 4."
			],
			"startTime": 1650083400000,
			"venue": "MBA/MCA BLOCK"
		},
		"Tug of words ": {
			"description": "Technical Debate ",
			"document": "",
			"endTime": 1649933460000,
			"eventName": "Tug of words ",
			"flagship": "false",
			"poster": "",
			"startTime": 1649928600000,
			"venue": "MCA block "
		},
		"Wild Flower": {
			"description": "The grand informal event where you get a chance to showcase your talent in singing, dancing, and what-not.",
			"document": "",
			"endTime": 1674916200000,
			"eventName": "Wild Flower",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha5/image/upload/v1674725684/techspardha22/events/ebbsfkj2us9tbe4upgit.png",
			"startTime": 1674901800000,
			"venue": "Jubliee Hall"
		}
	},
	"Managerial": {
		"ARISTOTLE": {
			"coordinators": [
				{
					"coordinator_name": "Toyesh ",
					"coordinator_number": "9650368001"
				},
				{
					"coordinator_name": "Ayush\t",
					"coordinator_number": "7678423041"
				},
				{
					"coordinator_name": "Salonee",
					"coordinator_number": "9818007485"
				}
			],
			"description": "Aristotle gives the participants a unique opportunity to experience the recruitment process that one faces during his/her quest for a job.",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/aristotle.pdf",
			"endTime": 1650020400000,
			"eventName": "ARISTOTLE",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649531020/techspardha/events/aristotle_t1fxh6.png",
			"rules": [
				"It is an individual member event.",
				" Each round shall be an elimination round.",
				" The written paper shall consist of the following divisions-  I. Language Ability  II. Quantitative Analysis  III. Qualitative Analysis",
				"The Group Discussion may include topics that range from factual to abstract and will follow the norms of a regular GD. Further detailed rules for the same will be explained at the time of the event itself.",
				" The participants shall be required to submit their updated resumes during their personal interview. Guidance for the preparation of the resume would be provided.",
				"The personal interview shall be a one on one interview round with the adjudicator/judge of the event."
			],
			"startTime": 1650011400000,
			"venue": ""
		},
		"Ad-diction": {
			"description": "An activity to test the creative abilities of the participants. ",
			"document": "",
			"endTime": 1650087180000,
			"eventName": "Ad-diction",
			"flagship": "false",
			"poster": "",
			"startTime": 1650083580000,
			"venue": "MBA block "
		},
		"Bidbizz": {
			"description": "An auctioning event by Innovation and Incubation Center which builds the real life auction atmosphere and tests your decision making and risk taking capability in high pressure scenarios as you bid on companies.",
			"document": "",
			"endTime": 1674817200000,
			"eventName": "Bidbizz",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674753084/techspardha22/events/pqmimvqqffbttx7k9bo7.jpg",
			"startTime": 1674802800000,
			"venue": "MBA Block "
		},
		"Business Plan": {
			"coordinators": [
				{
					"coordinator_name": "Tamanna",
					"coordinator_number": "8168033635"
				},
				{
					"coordinator_name": "Sankalp",
					"coordinator_number": "9462299498"
				}
			],
			"description": "Bussiness Plan is a business model competition organised by Icell, NIT Kurukshetra. Teams start with an idea from scratch and convert it into a practical business model. Then these models are presented to a judging panel who evaluates and awards the most impressive ideas. The event aims to foster the spirit of entrepreneurship among the student community and alongside teaching them how to prepare a business plan. B-Plan comprises of 2 rounds - the first round is abstract submission round of your idea . The abstract have to consist of idea vision , revenue generation , USP ( unique selling point) and marketing strategies. The second is presentation round which comprises of detailed walkthrough including the market research , revenue and cost analysis. Get a chance to earn cash prizes and sponsored trips worth ₹30k🤩 Contact us at icell@nitkkr.ac.in / 8816064590 / 8168033635 / 9462299498",
			"document": "",
			"endTime": 1650097800000,
			"eventName": "Business Plan",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649776346/techspardha/events/Bplan2_copy_-_Copy_zhzsku.jpg",
			"rules": [
				"The decision of the judges shall be final.",
				"You are expected to come up with new and innovative ideas, any idea that has been copied from somewhere will be disqualified.",
				"It is a team participation event with 2 or 3 members in each team."
			],
			"startTime": 1650079800000,
			"venue": "Electrical Department (E222)"
		},
		"Campus masterplan": {
			"coordinators": [
				{
					"coordinator_name": "Satyam ",
					"coordinator_number": "9812209115"
				},
				{
					"coordinator_name": "Adnan",
					"coordinator_number": "9756374207"
				},
				{
					"coordinator_name": "Amit",
					"coordinator_number": "9991233270"
				}
			],
			"description": "Provide a masterplan for NIT campus to be completed by 2030 covering all the issues in existing campus. Gear up to plan your dream campus of NIT,KURUKSHETRA taking into consideration the existing issues with 10 year of completion plan in \" Campus Planning , Techspardha'22 \" !! . Provide a masterplan for NIT campus to be completed by 2030 covering all the issues in existing campus.\n",
			"document": "https://forms.gle/EEviDczEH9AApwsc8",
			"endTime": 1650002400000,
			"eventName": "Campus masterplan",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649337106/techspardha/events/campus_masterplan_xavv1i.jpg",
			"rules": [
				"3. Participants should present power point presentation for the given problem statement.",
				"2. Creativity with cost optimization, resource allocation in NIT campus.",
				"1.There will be three participants per  team."
			],
			"startTime": 1649995200000,
			"venue": "Civil department"
		},
		"Case On Point": {
			"description": "A challenging case study competition where participants solve complex real world business problems and find solutions by analysis and in depth research of the current market.",
			"document": "",
			"endTime": 1674810000000,
			"eventName": "Case On Point",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674752692/techspardha22/events/ijwasafxoqrlmrlntox4.jpg",
			"startTime": 1674279000000,
			"venue": "MBA Block/Online"
		},
		"Case Study": {
			"coordinators": [
				{
					"coordinator_name": "Rahamath",
					"coordinator_number": "7382670742"
				},
				{
					"coordinator_name": "Radhika",
					"coordinator_number": "8570066413"
				}
			],
			"description": "Case studies provide an effective platform to educate tomorrow’s civil engineers with expertise and accomplish the desired aim of practice engineering. This offers good opportunities and a new source of interest to the students by creating a learning environment where students learn a sense of worth and accomplishment.\n\n\nThe Leaning Tower of Pisa is the freestanding bell tower of the cathedral of the Italian city of Pisa. Famous for its unintended tilt, the 56m tower took nearly 200 years to build work started in 1173. During this period of construction, it was observed that the tower started tilting noticeably. The shift was caused by shallow foundations of 3m and unstable subsoil. Engineers working on the tower in later years built upper floors with one side shorter than the other to compensate. This means the structure is curved as well as tilted. Attempts were made throughout the tower's history to correct the tilt. Some of them made the problem worse, and by the 1990s, there were fears the tower could collapse altogether. However, the structure stabilized in the coming years.",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSfsGmFFmeLhFXOswBm9rqWNZKfZ8NzDJ13KMzeGR80mIKmDaQ/viewform",
			"endTime": 1674885600000,
			"eventName": "Case Study",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha5/image/upload/v1674725289/techspardha22/events/gst2pn71xqqxdsurxd7l.png",
			"rules": [
				"All UG and PG students are eligible.",
				"Team should submit the PPT before presenting.",
				"Team should bring their own laptop with having HDMI port",
				"It is a 2 member event."
			],
			"startTime": 1674880200000,
			"venue": "Conference room"
		},
		"Corporate Roadies ": {
			"description": "Collection of management games to test your business acumen. ",
			"document": "",
			"endTime": 1650090600000,
			"eventName": "Corporate Roadies ",
			"flagship": "false",
			"poster": "",
			"startTime": 1649997060000,
			"venue": "MBA block"
		},
		"Erudite": {
			"coordinators": [
				{
					"coordinator_name": "Ashmit",
					"coordinator_number": "+919111135922"
				},
				{
					"coordinator_name": "Manish ",
					"coordinator_number": "8319062843"
				}
			],
			"description": "Erudite is a flagship fun event which helps you to analyze your multiple skills(mental ability, problem solving, public speaking, marketing and leadership skills). This is a team event(3-4 members) and has three elimination rounds.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650083400000,
			"eventName": "Erudite",
			"flagship": "true",
			"poster": "https://i.ibb.co/19T6J3x/gt7a0kcxgb22ceu1fkgm.png",
			"rules": [
				"Any type of unfair means will result in the disqualification and the following team will get a chance to participate."
			],
			"startTime": 1649593800000,
			"venue": "Lecture Hall"
		},
		"Exquizite": {
			"coordinators": [
				{
					"coordinator_name": "Sachin Bansal",
					"coordinator_number": "8572078278"
				},
				{
					"coordinator_name": "Kamal",
					"coordinator_number": "7206840407"
				},
				{
					"coordinator_name": "Ankit",
					"coordinator_number": "9057003837"
				}
			],
			"description": "It is the single member & most awaited quiz of Techspardha, where participants go through an elimination round and the finale has a limited no. of participants which exhaust their mental potential in two rounds to WIN.\n",
			"document": "https://docs.google.com/forms/d/e/1FAIpQLSe8h7y2EOASqnCgsukeg_Iym0f7-P5Q7h1shUOCH3f75WGxrw/viewform?usp=sf_link",
			"endTime": 1650060000000,
			"eventName": "Exquizite",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649495186/techspardha/events/EXQUIZITE_inbqb7.jpg",
			"rules": [
				"If in any case any 2 candidates will get same points then the winner will be declared on the basis of the marks obtained by them in the first round.",
				"In final round for each correct answer you will get +2 marks. For each wrong answer-1 marks will be deducted.",
				"•There will be 1/4th negative marking in written round.",
				"• Total no. of questions in written round will be 25.",
				"• The written round will be based on logical questions. ",
				" • Single member event."
			],
			"startTime": 1649968200000,
			"venue": "Electrical department"
		},
		"Fintellect ": {
			"description": "A finance quiz build to check your knowledge of financial jargons, stock market, investment and personal finance.",
			"document": "",
			"endTime": 1674891000000,
			"eventName": "Fintellect ",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674752957/techspardha22/events/ncqvlbr3ounhiipjskfa.jpg",
			"startTime": 1674883800000,
			"venue": "MBA Block"
		},
		"Market It ": {
			"description": "A marketting challenge wherein participants have to promote their brand in a way that makes an impression on the consumer's mind.",
			"document": "",
			"endTime": 1674819000000,
			"eventName": "Market It ",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674752827/techspardha22/events/ougo2oqaighua4p9ilq5.jpg",
			"startTime": 1674808200000,
			"venue": "MBA Block"
		},
		"Young Leaders": {
			"coordinators": [
				{
					"coordinator_name": "Ayush",
					"coordinator_number": "6386887424"
				}
			],
			"description": "A leader is the one who knows the way, goes the way, and shows the way.  Young Leaders provides you with an excellent opportunity to present your idea to change the world.  \n \nSelect any one of the 17 sustainable goals set by the United Nations in Agenda 2030, analyze the problem and present a viable solution.  \n \nROUNDS:  \nAbstract Submission   \nA brief discussion on the idea  \nPresentation and Case Study  \n \t \n",
			"document": "https://www.icellnitkkr.in/event/youngleaders",
			"endTime": 1650015000000,
			"eventName": "Young Leaders",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649737331/techspardha/events/YL_au5qtt.jpg",
			"rules": [
				"A team can have 3 members. ",
				"The abstract should mention the goal it is targeting,  the brief about the idea and feasibility of the idea. ",
				"A report should also be submitted before the day of presentation. ",
				"You have to include your case study points into your presentation.(2-3 slides) ",
				"Time allotted per team for presentation is 15 minutes and 5 minutes for case study. There  will be negative marking if you exceed the time limit. ",
				"The presentation should contain the description of the idea and how it can be  implemented  practically with all cost estimations and other details. And how can  we reach the goal of sustainable development by implementing your idea.  "
			],
			"startTime": 1649386800000,
			"venue": "MBA Block"
		}
	},
	"Online-Events": {
		" WEBHUNT": {
			"coordinators": [
				{
					"coordinator_name": "Akshat",
					"coordinator_number": "7999910962"
				},
				{
					"coordinator_name": "Monika",
					"coordinator_number": "9602054424"
				}
			],
			"description": "Everyone thinks of being a pirate 🥷🏻at some point in their life, so, we at TechSpardha’22 are back with WebHunt 🔎 to bring out the Jack Sparrow 🏴‍☠️ inside of you and find the Isle of Lusee 🏝 .\n\nYou'll be provided with some fun 👾and challenging riddles 🪄 from various fields, be it your favorite tv shows 📺, the games🎮 you play every day or just anything you can ever imagine of.\n\nWith Google  (who uses Bing? btw) at your disposal, search 🔍 anything you want to get to the answer.",
			"document": "https://bit.ly/WebHunt2k22",
			"endTime": 1674905400000,
			"eventName": " WEBHUNT",
			"flagship": "false",
			"poster": "https://i.ibb.co/dksh32G/webhunt.jpg",
			"rules": [
				"Team size should be 2.",
				"Inter year teams are allowed",
				"Use of google is mandatory."
			],
			"startTime": 1674811800000,
			"venue": "Computer Engineering Department"
		},
		"Aristotle": {
			"coordinators": [
				{
					"coordinator_name": "Vishal",
					"coordinator_number": "8318284204"
				},
				{
					"coordinator_name": "CV Sai Teja",
					"coordinator_number": "9121780873"
				},
				{
					"coordinator_name": "Swati Sharma",
					"coordinator_number": "7404604536"
				}
			],
			"description": "An interview will not only provide you with experience, but also confidence and will be an important step in obtaining post-graduate employment.\n\nMicrobus presents \"ARISTOTLE\", a never-ending opportunity to test your interview preparedness and improve them. Three rounds, each more competitive than the previous, and there you will be, ready to be your best self prelims, group discussion, Case study and personal interview, each one of them helping you understand your strengths and weakness. \n\nPeople say, the more you try at it the more you get at it. So, gear yourself up for this tremendous experience.\n\nRounds:\n1. Written test - Aptitude\n2. Group Discussion\n3. Personal Interview",
			"document": "",
			"endTime": 1674819000000,
			"eventName": "Aristotle",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha4/image/upload/v1674618867/techspardha22/events/vimwb4sgnwxixhommgdi.jpg",
			"rules": [
				"It is a mock placement event.",
				"Each round shall be an elimination round.",
				"The written paper shall consist of the following divisions-        I. Language Ability        II. Quantitative Analysis        III. Qualitative Analysis",
				"The Group Discussion may include topics that range from factual to abstract and will follow the norms of a regular GD. Further detailed rules for the same will be explained at the time of the event itself.",
				"The participants shall be required to submit their updated resumes during their personal interview. ",
				"The personal interview shall be a one on one interview round with the adjudicator/judge of the event."
			],
			"startTime": 1674795600000,
			"venue": "Online(unstop)"
		},
		"ELECTRICA": {
			"coordinators": [
				{
					"coordinator_name": "Shailendra ",
					"coordinator_number": "7734921195"
				},
				{
					"coordinator_name": "Shivam",
					"coordinator_number": "7895196893"
				},
				{
					"coordinator_name": "Kapil",
					"coordinator_number": "9509355487"
				}
			],
			"description": "“As engineers, we were going to be in a position to change the world – not just study it.” — Henry Petroski,\nAnd as an electrical engineer, we \"step up\" and we \"transform\" since No resistance can drop our potential!\n\nIf you want to showcase your Logical skills, your aptitude and of course your electrical knowledge then this event is for you.\n\nElectrica is an online event organized by Electroreck that challenge you for your problem solving skills in a three day timeline with some hints for some of the grueling problems.",
			"document": "",
			"endTime": 1650043800000,
			"eventName": "ELECTRICA",
			"flagship": "false",
			"poster": "https://i.ibb.co/bB1vQcZ/aani7fksag9rhkikzmie.jpg",
			"rules": [
				"Group event consist of maximum 2 members. Any engineering undergraduate student can participate. The quiz is based on core electrical knowledge where participants will be given puzzles to solve based on hints provided at particular intervals."
			],
			"startTime": 1649817000000,
			"venue": "ONLINE"
		},
		"Tradehunt": {
			"coordinators": [
				{
					"coordinator_name": "Aman",
					"coordinator_number": "7834899932"
				}
			],
			"description": "Tradehunt is a crypto trading competition where participants use their mind to get the most profit using the $50,000 provided in the contest. It will be an ideal competition for traders as well as the newbies. Stock trading/ investing is not a thing that can be learnt theoretically but can only be learnt by some real life experience. This event will help all the participants to learn trading by competing with some good traders.",
			"document": "https://play.google.com/store/apps/details?id=com.tradehunt",
			"endTime": 1650087000000,
			"eventName": "Tradehunt",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649737118/techspardha/events/Tradehunt_nhrt5w.png",
			"rules": [
				" If anyone is found cheating, playing in teams or misusing the platform, he/she will be debarred from the event with strict actions.",
				"You can only enter leaderboard if you make your first order & have an active holding.",
				"When you register on the form, we will send you an invite code which is exclusive for you. You will have to use it to enter the contest. Till that time, there is a sample contest where you can go and try out the app.",
				"The top 5 traders who will make the highest profit at the end of the event will win real cash prizes and goodies",
				"It is a solo 7 day-long event."
			],
			"startTime": 1649568600000,
			"venue": "Online"
		},
		"Web-Set-Hunt": {
			"coordinators": [
				{
					"coordinator_name": "Vishal",
					"coordinator_number": "8318284204"
				},
				{
					"coordinator_name": "Saksham",
					"coordinator_number": "9982805276"
				},
				{
					"coordinator_name": "Surya",
					"coordinator_number": "9390152476"
				}
			],
			"description": "Join the ultimate online scavenger hunt and put your internet sleuthing skills to the test! Race against the clock to complete tasks and find answers hidden within the vast expanse of the web. Prizes await the victors in this thrilling competition of wits and speed.\nCome join us for the nail biting event of the year! So let's just web set hunt!\nAn event where the participants will hunt for facts or information online in order to reach the solution.",
			"document": "",
			"endTime": 1674849600000,
			"eventName": "Web-Set-Hunt",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674639964/techspardha22/events/djqtrndw9kosl4iqfetj.jpg",
			"rules": [
				"It is a 2 member team event.",
				"The participants have to solve cryptic-codes/questions. The team that solves the maximum number of questions in a given time wins.",
				"Any team which is unable to solve first six questions in a given time will be eliminated.",
				"Every team has to join the discord channel, the link to which will be provided.",
				"Every registered student has to be a part of a team. ",
				"Every registered student has to fill the profile section on the website to participate in the event."
			],
			"startTime": 1674835200000,
			"venue": "Online"
		},
		"Workshop": {
			"coordinators": [
				{
					"coordinator_name": "Love",
					"coordinator_number": "8890814895"
				}
			],
			"description": "Workshop related to Staad-Pro software for civil engineering students.\n",
			"document": "",
			"endTime": 1648481400000,
			"eventName": "Workshop",
			"flagship": "false",
			"poster": "",
			"startTime": 1648215000000,
			"venue": "Online"
		}
	},
	"Papyrus-Vitae": {
		"Keynote": {
			"coordinators": [
				{
					"coordinator_name": "Mangesh",
					"coordinator_number": "8619638640"
				},
				{
					"coordinator_name": "Divya",
					"coordinator_number": "9458153120"
				}
			],
			"description": " KeyNote is a presentation event where you and your team would be given a Scientific or technological topic to write a technical paper on and thereafter present it. The event aims to inculcate strong presentation skills, communications skills and teamwork among students.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1649995200000,
			"eventName": "Keynote",
			"flagship": "false",
			"poster": "https://i.ibb.co/mby1JWt/y2gqifqe7loonge27q0c.png",
			"rules": [
				"The time allocated for presentation to a team is 15 mins. Exceeding the same would attract penalties The report must be in IEEE(conference paper A4) format. ( Refer : Link ) ",
				"One student can be a member of only one team.",
				"However, Only 1 topic would proceed to the further rounds. ",
				"One team can select upto 2 topics during the first round. ",
				"The event would be a team event with maximum 2 students in a team. "
			],
			"startTime": 1649590200000,
			"venue": "Lecture Hall"
		}
	},
	"Programming": {
		"Black Box": {
			"coordinators": [
				{
					"coordinator_name": "Bhavesh Gupta",
					"coordinator_number": "9521221162"
				},
				{
					"coordinator_name": "Renu",
					"coordinator_number": "7082481332"
				}
			],
			"description": "Hola Sherlock's 🧐🧐\\nBring into play the principle of reversibility🔄 in your heads and pen down your arithmetic skills📝 to find the raw data as we are back with brainstorming🤯 event of the era , Black Box📦 at Techspardha 2K23!\\nPut your quizzing caps🤠 on and get ready to sweat to compete with amazing.",
			"document": "https://bit.ly/BlackBox23",
			"endTime": 3211200000,
			"eventCategory": "Programming",
			"eventName": "Black Box",
			"flagship": "false",
			"poster": "https://i.ibb.co/CMDkkRJ/IMG-20230120-WA0047.jpg",
			"rules": [
				"Standard rules of programming contest will be enforced.",
				"Single Member Event."
			],
			"startTime": 1389600000,
			"venue": "CS Department 2"
		},
		"COMCAT": {
			"coordinators": [
				{
					"coordinator_name": "Varchasv",
					"coordinator_number": "9953303061"
				},
				{
					"coordinator_name": "Raj Nandini",
					"coordinator_number": "7903900667"
				},
				{
					"coordinator_name": "Arzaw",
					"coordinator_number": "9554251486"
				}
			],
			"description": "ComCat is an event to test your skills with the ultimate MATLAB task and showcase your talent to reach a step further to becoming the next gen communication engineer. ",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/comcat.pdf",
			"endTime": 1650177000000,
			"eventName": "COMCAT",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649531091/techspardha/events/comcat_q6vvcn.png",
			"rules": [
				"It will be an individual member event. ",
				" The contestants should have preliminary idea about implementation of filters and other relevant functions and commands of MATLAB. "
			],
			"startTime": 1650169800000,
			"venue": "L - Block"
		},
		"Cyber cipher": {
			"description": "Interested in decoding the codes ? Flex your spying skills. ",
			"document": "",
			"endTime": 1650087240000,
			"eventName": "Cyber cipher",
			"flagship": "false",
			"poster": "",
			"startTime": 1649997240000,
			"venue": "MCA department "
		},
		"Debugmania": {
			"coordinators": [
				{
					"coordinator_name": "Sachchidanand",
					"coordinator_number": "+91 75439 48638"
				},
				{
					"coordinator_name": "Neeraj",
					"coordinator_number": "+91 85109 24347"
				}
			],
			"description": "❖Interested in programming? StuckinDEBUGGING? Ifyes,then thisisthe rightplace foryou!!!\n❖Use your debugging skills and find out the bugs. Use your keen eye and great logical thinking. Find the bugs in the code and\nprove thatyouare areal‘DEBUGGER’.\n",
			"document": "https://github.com/technobyte-nitkkr",
			"endTime": 1703647980000,
			"eventCategory": "Programming",
			"eventName": "Debugmania",
			"flagship": "false",
			"poster": "https://i.ibb.co/X36PbnV/debug.jpg",
			"rules": ["Individual entries allowed"],
			"startTime": 1648693920000,
			"venue": "Google form"
		},
		"Digital Image Processing": {
			"coordinators": [
				{
					"coordinator_name": "Shivam ",
					"coordinator_number": "+91 7082681580"
				},
				{
					"coordinator_name": "Shantanoo",
					"coordinator_number": "+91 9399949246"
				}
			],
			"description": "Wonder anytime what is behind those images which can replicate even the reality and can immerse us in a world which doesn't require our physical presence? Welcome to an event wherein you can play with the images using your imagination to give a whole new perspective to define the images.\nGear up for the event Digital Image Processing wherein you would be given the chance to explore the images by using your might. \n \nWhat's this ?\n1. Here we will test your knowledge of images, data structures that holds these images in memory and algorithms that can manipulate these images. \n2. You will be given some tasks related to known image processing algorithms.\n \nWhy this ? \n1. To make you a better thinker, know the inner workings of images.\n2. Use open-sourced libraries like OpenCV to implement the algorithms\n\nTo participate in the event fill the following form:\nhttps://forms.gle/v8hSicQHTyfvELRa8",
			"document": "https://github.com/technobyte-nitkkr",
			"endTime": 1606458600000,
			"eventName": "Digital Image Processing",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/dvhrzmkwd/image/upload/v1648977964/techspardha/events/zwm4cjokcnrn91kfsvaz.jpg",
			"rules": [
				"Those using codes from GitHub etc. will be disqualified.",
				"Copying code from internet is strictly prohibited.",
				"The students should get the required software installed before coming for  the final event.",
				"The image will be given on the spot.",
				" First round - Quiz covering basics of image processing and  aptitude.",
				"There will be two rounds.",
				"It's a two-member event."
			],
			"startTime": 1606455000000,
			"venue": "Google Meet"
		},
		"Encoder": {
			"coordinators": [
				{
					"coordinator_name": "Krish",
					"coordinator_number": "8708275348"
				},
				{
					"coordinator_name": "Bhagat",
					"coordinator_number": "9066000110"
				}
			],
			"description": "Impress FAANG by showcasing your coding skills in \"Encoder,\" as these tech giants often recruit from platforms like Code studio! 🌟🚀🧠\n\n🕰️Set your alarms and clear your schedule! On March 14th, 2024, at 9:00 P.M.,Technobyte will host a 2-hour coding marathon on code studio where you can test your skills against some of the brightest minds in the coding community. 🕰️\n\n🧠 Crack six brain-bending problems in 2 hours and prizes worth ₹4,000 & premium coding ninja merchandise. 🔥\n🧠👾This is your chance to embark on an exciting coding adventure, hone your skills, and connect with like-minded individuals who share your passion for technology. 🖥️💻\nSo, what are you waiting for? 🌟\nLet's dive into the world of coding and see where your talents can take you! 🚀🧠👾\n\n*Gform link*: https://forms.gle/6fzGjnaq9vzYxHhJ8\n*Link for registration*: http://tinyurl.com/CENITK14MARCH\n\n*It is mandatory to fill both form and register through above link for a valid participation*\n_Registration should be done using above links only_",
			"document": "https://forms.gle/6fzGjnaq9vzYxHhJ8",
			"endTime": 1710394200000,
			"eventCategory": "Programming",
			"eventName": "Encoder",
			"flagship": "false",
			"poster": "https://i.ibb.co/rtxTpyN/blob.jpg",
			"rules": [
				"Standard rules of programming contest will be enforced.",
				"Single Member Event."
			],
			"startTime": 1710387000000,
			"venue": "https://forms.gle/6fzGjnaq9vzYxHhJ8"
		},
		"Excalibur": {
			"coordinators": [
				{
					"coordinator_name": "Deepak",
					"coordinator_number": "7027955315"
				},
				{
					"coordinator_name": "Subhi",
					"coordinator_number": "8287626910"
				}
			],
			"description": "\"The purpose of technology is not to confuse the brain, but to serve the body\"\n\nDo you consider yourself as the most competitive person in a room? Do challenges excite you? Are you interested in tickling your brain and fueling your grey matter to create an impact?\n\nEXCALIBUR, the flagship event of Technobyte gives you the opportunity to do all of this, along with winning exciting prizes for your innovative solutions.\nIf you want to showcase your analytical, technical and problem solving skills and get exposure to industry-leading ventures, create a team, participate and elevate your creativity.",
			"document": "https://bit.ly/Excal23",
			"endTime": 1710617400000,
			"eventCategory": "Programming",
			"eventName": "Excalibur",
			"flagship": "true",
			"poster": "https://i.ibb.co/T8KZLM3/blob.jpg",
			"rules": [
				"Use of Git is mandatory.",
				"After completion, the event itself would have a presentation and a working demo of the project.",
				"After proper evaluation, if the idea is selected, you’ll be assigned a mentor to complete the project before the final event.",
				"First round: Abstract submission, abstract must include, the team members, the title of the project, the idea elaborated, tech stack to be used.",
				"Team size should be 1-4. Inter-year teams are allowed.",
				"Three rounds"
			],
			"startTime": 1709181000000,
			"venue": "Conference room"
		},
		"Hackshetra": {
			"coordinators": [
				{
					"coordinator_name": "Aniket",
					"coordinator_number": "9818621746"
				},
				{
					"coordinator_name": "Mayank",
					"coordinator_number": "9910867228"
				}
			],
			"description": "📢 Calling all developers! Get ready to transform your coffee☕ into code on the most thrilling tech battlefield – Hackshetra🤖, brought to you by Techspardha’24 at NIT Kurukshetra. Grab your laptops💻 and brace yourselves for 24 hours of non-stop coding excitement! Show off your development skills and compete for prizes🏆 worth 6K.\n\nAt Hackshetra, you'll face challenges based on themes💡 revealed on the spot. Choose your problem statements 🎯 and leverage cutting-edge software technologies to craft innovative solutions.\n\nNo prior experience is necessary – all you need is the passion to learn. Whether you're a beginner or a seasoned coder, this event is your chance to shine and unleash your creativity🧩. Get ready to dive into the action-packed tech battlefield!\n\nMark your calendars🗓️ for 9th–10th March, 2024. The event kicks off at 11 am sharp on 9th March in the 📍CCN block.",
			"document": "https://forms.gle/tksmA7DHExC1EwPv6",
			"endTime": 1710048600000,
			"eventCategory": "Programming",
			"eventName": "Hackshetra",
			"flagship": "true",
			"poster": "https://i.ibb.co/9pXvS20/blob.jpg",
			"rules": [
				"The only eligibility criteria to take part is to have will to learn🤓 and your creativity is the limit. Get ready to have one of the biggest learning experiences in just 24 hours!!! 🥳🔥",
				"Team up (2-4 members)",
				"Initial elimination based on proposed solutions and designs.",
				"Second elimination evaluates progress made during the event."
			],
			"startTime": 1709962200000,
			"venue": "CCN"
		},
		"Productathon": {
			"coordinators": [
				{
					"coordinator_name": "Ajay Arya",
					"coordinator_number": "9991776566"
				},
				{
					"coordinator_name": "Sharayu",
					"coordinator_number": "8999855212"
				}
			],
			"description": "Productathon is a rigorous online Hackathon for creating an innovative solution to the given product statements. It will be an ideal platform for tech-enthusiasts to collaborate with similar-minded people from various domains. In this event the team will be a useful product focused on some of the themes given to them and the aim is to create a next-gen product that can be useful according to the theme of E-Summit. This is a team event with lots and lots of learning and enjoyment as well through various activities.",
			"document": "https://www.icellnitkkr.in/event/productathon",
			"endTime": 1649928600000,
			"eventCategory": "Programming",
			"eventName": "Productathon",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649737050/techspardha/events/Productathon_22_ru6cdj.png",
			"rules": [
				"You can develop your solutions any way you want - using hardware or software",
				"You are expected to come up with new and innovative ideas, any idea that has been copied from somewhere will be disqualified.",
				"It will be a 24 hour long contest.",
				"This is a team participation hackathon. You can have 4 - 5 members in your team."
			],
			"startTime": 1649917800000,
			"venue": "CCN, NIT Kurukshetra 3"
		},
		"Tame the Brute": {
			"description": "Optimize the codes that works exceedingly well. ",
			"document": "",
			"endTime": 1650087000000,
			"eventName": "Tame the Brute ",
			"flagship": "false",
			"poster": "",
			"startTime": 1650000900000,
			"venue": "MCA department"
		}
	},
	"Quizzes": {
		"Aero Quiz": {
			"coordinators": [
				{
					"coordinator_name": "Amit",
					"coordinator_number": "9467803801"
				},
				{
					"coordinator_name": "Satyam Sihare",
					"coordinator_number": "7697375598"
				}
			],
			"description": "What could be more exciting than acquiring knowledge in an amusing way? Aero-Quiz is a fun quiz which mainly focuses on spreading the knowledge in a unique and fascinating way. Participants are required to form a two member team. Questions would be asked from each teams regarding the Airplanes, Hovercrafts, Drones, Rockets and current headlines of the aeronautical world.",
			"document": "https://github.com/technobyte-nitkkr",
			"endTime": 1646024400000,
			"eventName": "Aero Quiz",
			"flagship": "true",
			"poster": "https://github.com/technobyte-nitkkr",
			"rules": [
				"2 member team event.",
				"Any kind of cheating is strictly prohibited, if found guilty then that team will be disqualified.",
				"For the first round, all team member have to give test individually and total marks of the team would be considered for selection of whole team, so the participation of both the team member is must."
			],
			"startTime": 1646019000000,
			"venue": "https://github.com/technobyte-nitkkr"
		},
		"B-Quiz": {
			"coordinators": [
				{
					"coordinator_name": "Shubh",
					"coordinator_number": "7470614262"
				},
				{
					"coordinator_name": "Parixit",
					"coordinator_number": "9306301442"
				}
			],
			"description": "What happens when knowledge meets bollywood ? We present to you a fun & informative KBC-styled trivia where you can win real cash prizes by answering simple questions. \nThe event will have three rounds:\nPen-Paper Quiz ( Elimz ) 11-12-13th April\nFastest Finger First\nHot Seat Round\n",
			"document": "https://www.icellnitkkr.in/event/bquiz",
			"endTime": 1650105000000,
			"eventName": "B-Quiz",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649737221/techspardha/events/BQuiz_sqdrxo.jpg",
			"rules": [
				"You will have 3 lifelines to use within the game",
				"The use of mobile phones in any round is strictly prohibited and the student will be debarred from the event if caught",
				"This is a single-membered event"
			],
			"startTime": 1649646000000,
			"venue": "Lecture Hall Complex"
		},
		"BRAINSTORM": {
			"coordinators": [
				{
					"coordinator_name": "Sunidhi",
					"coordinator_number": "7496880681"
				},
				{
					"coordinator_name": "Khushboo",
					"coordinator_number": "9729123667"
				},
				{
					"coordinator_name": "Prathamesh",
					"coordinator_number": "9306573537"
				}
			],
			"description": "Brainstorm is a trivia quiz about unconventional and interesting facts about all and any topics or subjects.",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/brainstorm.pdf",
			"endTime": 1650088800000,
			"eventName": "BRAINSTORM",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649530982/techspardha/events/brainstorm_l6sajr.png",
			"rules": [
				" It is a 3 member team event.",
				" First round is an elimination round.",
				"The written paper shall consist of the questions from fields like entertainment, science, sports, general affairs. ",
				"The main quiz will have different rounds.",
				"Team scoring maximum score in the main quiz will be the winner of the competition."
			],
			"startTime": 1650085200000,
			"venue": "L - Block"
		},
		"Brainstorm": {
			"coordinators": [
				{
					"coordinator_name": "Hemant pandey",
					"coordinator_number": "8529252380"
				},
				{
					"coordinator_name": "Manoj",
					"coordinator_number": "8179515295"
				},
				{
					"coordinator_name": "Kamakshi",
					"coordinator_number": "7988228944"
				}
			],
			"description": "A warrior's strength is only realized in the battlefield and so of the knowledge and intellect in a Quiz.So, Gear up, because Microbus is excited to announce the most nail biting event of all \"BRAINSTORM\".\n\nDisplay your spectrum of knowledge in various fields from science, sports, general affairs to many more mind boggling topics.Now is the time to show how much you know.Prepare your team and co-ordinate your strategies. May the best team win.\nRounds:\n  1. Written test – General Knowledge.\n  2. Quiz",
			"document": "",
			"endTime": 1674907200000,
			"eventCategory": "Quizzes",
			"eventName": "Brainstorm",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha4/image/upload/v1674623376/techspardha22/events/lug17zhtzlnxzqqtjinz.jpg",
			"rules": [
				"It's a 2 member team event",
				"First round is elimination round.",
				"The written paper shall consist of the questions from fields like entertainment, science sports, general affairs. ",
				"The main quiz will have different rounds.",
				"Team scoring maximum score in main quiz will be winner of the competition"
			],
			"startTime": 1674894600000,
			"venue": "L-Block"
		},
		"CV Quiz": {
			"coordinators": [
				{
					"coordinator_name": "Raman",
					"coordinator_number": "9950859442"
				},
				{
					"coordinator_name": "Deepak",
					"coordinator_number": "8295766064"
				}
			],
			"description": "A quiz related to civil engineering.\n",
			"document": "https://forms.gle/3Qv4ohg1BL9YVrvx5",
			"endTime": 1650056400000,
			"eventName": "CV Quiz",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649496436/techspardha/events/cv_quiz_wwempw.jpg",
			"rules": [
				" 3. Each round consists of 30 questions.  • Duration of written test is 40 minutes.  • The decision of quiz master is final and binding.",
				"2. Two rounds event.  • 1st round includes aptitude and general engineering.  • 2nd round includes technical questions.  • There will be different technical questions for first, second and third year  respectively.",
				"1.Single member event."
			],
			"startTime": 1650092400000,
			"venue": "Civil department (C-103)"
		},
		"CV Quizz": {
			"coordinators": [
				{
					"coordinator_name": "Shanmukha",
					"coordinator_number": "7013288600"
				},
				{
					"coordinator_name": "Akhila ",
					"coordinator_number": "8688936396"
				},
				{
					"coordinator_name": "Sneha",
					"coordinator_number": "9350241730"
				}
			],
			"description": "It is the single-member event & most awaited quiz of Techspardha, where participants go through an elimination round. The finale has a limited number of participants who exhaust their mental potential in two rounds to WIN. Irrespective of the year, this quiz is based on the subjects you studied and some basic civil engineering stuff.",
			"document": "https://docs.google.com/forms/d/1VmKGdhDizItFeHNqU5TcY0n63_Ik4XS-bHrYT6Pty6E/edit",
			"endTime": 1674894600000,
			"eventName": "CV Quizz",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha5/image/upload/v1674724658/techspardha22/events/phoprsf1tabqcisitpio.png",
			"rules": [
				"Single member event, conducted in 2 rounds. The written round will be based on logical questions. Total no. of questions in both rounds will be 30",
				"Duration of the written round will be 30 min. There will be 1/4 negative marking in the first round.",
				"In the final round, you will get +2 marks for each correct answer. For each wrong answer, a -1 mark will be deducted.",
				"If in any case, any 2 candidates will get same points then the winner will be declared on the basis of the marks obtained by them in the first round."
			],
			"startTime": 1674793800000,
			"venue": "C-103 (Civil Department)"
		},
		"E-MODELLING": {
			"coordinators": [
				{
					"coordinator_name": "Dev",
					"coordinator_number": "8505827729"
				},
				{
					"coordinator_name": "Shubham",
					"coordinator_number": "8950113509"
				},
				{
					"coordinator_name": "Rajat\t",
					"coordinator_number": "7082329233"
				}
			],
			"description": "An event to bridge the gap between theoretical and practical knowledge to discover the true engineer in you.",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/emodelling.pdf",
			"endTime": 1650006000000,
			"eventName": "E-MODELLING",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649530915/techspardha/events/emodelling_fehbzk.png",
			"rules": [
				" It is a 2 member team event.",
				"The written paper shall consist of practical questions from the coursework.",
				" Each round shall be an elimination round.",
				"The practical round will be held in electronics labs where the participants have to perform the  experiment assigned to them.",
				"There will be negative marking in the Buzzer Round.",
				"In the Buzzer Round , the team pressing the buzzer first will be given the first chance to answer and it will be decided by the coordinators."
			],
			"startTime": 1649991600000,
			"venue": "L - Block"
		},
		"E-modelling": {
			"coordinators": [
				{
					"coordinator_name": "Praneeth",
					"coordinator_number": "7569225090"
				},
				{
					"coordinator_name": "Lavanya",
					"coordinator_number": "8688992275"
				},
				{
					"coordinator_name": "Shikhar",
					"coordinator_number": "9729598664"
				}
			],
			"description": "Digital age problems require digital solutions. Enough of writing solutions on a sheet of paper, it's time to bring them to reality.\nMicrobus brings you the most startling event of the year - \"E-Modelling\".\nTime to use your mind to play games like never before. Solve the quiz. Model your solutions on a simulator. Win the prize! \nSeems easy? Then come and be a part of this amazing event.\nSpecially designed to melt your brain, so prepare well as the bar will only go higher.\nRounds:\n1. Written test\n2. Buzzer Round",
			"document": "",
			"endTime": 1674975600000,
			"eventName": "E-modelling",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha8/image/upload/v1674623987/techspardha22/events/shqvsbhbjgd4iu5akwiv.jpg",
			"rules": [
				"It's a 2 member team event",
				"The written paper shall consist of practical questions from the coursework.",
				"Each round shall be an elimination round.",
				" There will be negative marking in the Buzzer Round"
			],
			"startTime": 1674963000000,
			"venue": "L-Block"
		},
		"GEEK QUIZ": {
			"coordinators": [
				{
					"coordinator_name": "Aditi",
					"coordinator_number": "9521452283"
				},
				{
					"coordinator_name": "Manish",
					"coordinator_number": "8319062843"
				}
			],
			"description": "Geek Quiz is a fun team event which tests a person’s knowledge regarding diverse domains such as Technology and Innovation, Sports and Entertainment, History, literature and Current Affairs, in short anything and everything under the sun.",
			"document": "https://forms.gle/MxreF8gVipn76EeQ7",
			"endTime": 1650090600000,
			"eventName": "GEEK QUIZ",
			"flagship": "false",
			"poster": "https://i.ibb.co/nByScvZ/xwbrqzxfqgjzoc87mpy5.png",
			"rules": [
				"Use of internet or any other unfair means would result in disqualification ",
				"The quiz would be a team event with maximum 2 students in a team"
			],
			"startTime": 1649853000000,
			"venue": "Lecture Hall"
		}
	},
	"Robotics": {
		"Bit coding": {
			"coordinators": [
				{
					"coordinator_name": "Saumya",
					"coordinator_number": "9760779367"
				},
				{
					"coordinator_name": "Saransh",
					"coordinator_number": "6376180689"
				}
			],
			"description": "Phase 1: 11-12 April (5:00 PM to 7:00 PM) \nPhase 2: 15 April (5:00 PM to 6:00 PM) \nPhase 3: 16 April (5:00 PM to 6:00 PM)\n\nBit coding is a competitive programming contest with hints of bit manipulation \nand arithmetic.\n",
			"document": "https://forms.gle/43pmHaTEhML6FwqMA",
			"endTime": 1649772000000,
			"eventName": "Bit coding",
			"flagship": "false",
			"poster": "https://i.ibb.co/289bxZ1/Bit-coding-poster.png",
			"rules": [
				"No internet usage is allowed for phases 2 and 3.",
				"PC is allowed on-site for Phase 2.",
				"Participants can attempt the assessment anytime between the provided assessment window.",
				"Please ensure that participants attempt the assessment in one sitting as once you start the assessment, the timer won’t stop.",
				"Any participants restoring to unfair practices will be directly disqualified from the event."
			],
			"startTime": 1667559600000,
			"venue": "L Block"
		},
		"MICRO XPLORER": {
			"coordinators": [
				{
					"coordinator_name": "Vishnu\t",
					"coordinator_number": "6350043727"
				},
				{
					"coordinator_name": "Rajat",
					"coordinator_number": "7082329233"
				},
				{
					"coordinator_name": "Leeladhar",
					"coordinator_number": "9398447377"
				}
			],
			"description": "You need to design a bot that can be manually controlled from a distinct location using wireless \ncommunication techniques such as Bluetooth, wifi, RF module, DIP, etc.\n",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/micro-xplorer.pdf",
			"endTime": 1650088800000,
			"eventName": "MICRO XPLORER",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649531238/techspardha/events/micro_explorer_mimdth.png",
			"rules": [
				"The robot must be controlled wirelessly, there will be bonus points if you control the bot using self made android apps, or gestures.",
				"Each team must have four members and among the four members, only one must be the driver and one must be the guide.",
				"Manual touch is not allowed once the game begins.",
				"Bot dimensions must not exceed 250mm*250mm*250mm(Lifting mechanism not included) and the Potential difference between any two points on the robot must not exceed 18V.",
				"The bot should possess an onboard power supply. Use of adapters is also allowed but there will be a penalty.",
				"Lego kits are not allowed.",
				"Extra points would be given for bot that has a lifting mechanism which can lift a block and place it in desired  position(size of the block varies from 40mm*40mm*40mm to 90mm*90mm*60mm). The block  mentioned here will be made up of thermocol sheets.",
				"The bot must reach the end point. The bots failing to do so will not be considered for evaluation.",
				"For each obstacle hit and failing to cross a bump, they have to suffer a penalty of 10 and 15 seconds  respectively.",
				"Robots crossing the boundary line of the arena need to again start from previously crossed checkpoints (for 3 wheelers any one of the back wheels crossing the line will be considered a fault for 4 wheelers any two of the wheels crossing the boundary will be considered a fault).",
				"Bonus points for using a self-made android app or gesture control (-60 sec), use of adapter will lead to penalty (+60 sec) and bonus points on completion of assigned tasks using lifting mechanisms.",
				"The team finishing the task in the least time will be considered as the winner."
			],
			"startTime": 1650078000000,
			"venue": "L - Block"
		},
		"Maze Up": {
			"coordinators": [
				{
					"coordinator_name": "Sparsh Sharma",
					"coordinator_number": "8383071758"
				},
				{
					"coordinator_name": "Ritik Sethi ",
					"coordinator_number": "9053191376"
				}
			],
			"description": "Maze-up is a team event where bots travel autonomously through a maze \navoiding obstacles and reaching the endpoint.\n",
			"document": "https://forms.gle/merqHLspuDZ91Hah9",
			"endTime": 1650007800000,
			"eventName": "Maze Up",
			"flagship": "true",
			"poster": "https://i.ibb.co/f0K2VzQ/Maze-Up-poster.png",
			"rules": [
				"Team size must not exceed 4 members.",
				"The bot dimension must not exceed 300mm*300mm*200mm.",
				"The potential difference between any 2 points must not exceed 12V. No manual transmission of data must be there to the bot, it must be fully autonomous.",
				"Bots will follow the black line to solve the maze which will have a thickness of 20mm.",
				"The bot must not be using any weapons or anything that can harm either the other bot or the arena itself.",
				"Each team will be provided with 2 runs to solve the maze, with tweaking of code allowed in reference to the maze, but no hard coding is allowed. Only 2 repositions are allowed to the last checkpoint in case of some issue with the bot.",
				"Each round will last for 5-10 minutes.",
				"The starting point will be decided by the judges and will remain the same for all 3 runs.",
				"Once the bot enters the maze, no human intervention is allowed."
			],
			"startTime": 1649993400000,
			"venue": "AE Lawns"
		},
		"Micro Explorer": {
			"coordinators": [
				{
					"coordinator_name": "Akshai",
					"coordinator_number": "6301032335"
				},
				{
					"coordinator_name": "Devi",
					"coordinator_number": "7893788927"
				},
				{
					"coordinator_name": "Ramya",
					"coordinator_number": "9515982454"
				}
			],
			"description": "You are on a secret mission to explore an unknown terrain and you are using a robot to gather information about the terrain. The bot is autonomous, but has a backup system to control it manually using a wireless transmitter. Your bot has been partially damaged by the enemy, but manual control is still working. Now Your task is to bring back the bot safely to your area in minimum possible time.\nThe arena will be a rough terrain that will consist of curved path, inclinations, obstacles, sharp turns,rotating platforms, tunnels and checkpoints.",
			"document": "",
			"endTime": 1674903600000,
			"eventName": "Micro Explorer",
			"flagship": "true",
			"poster": "https://res.cloudinary.com/techspardha1/image/upload/v1674639704/techspardha22/events/joowv8qli8uth8ukrgfh.jpg",
			"rules": [
				"The robot must be controlled wirelessly.",
				"There will be bonus points if you control the bot using self made android apps,or gestures.",
				"Each team must have three members.",
				"Among the three members, only one must be the driver and one must be the guide.",
				"Manual touch is not allowed once the game begins.",
				"The bot should possess an onboard power supply. Use of adapters is also  allowed but there will be a penalty.",
				"Lego kits are not allowed."
			],
			"startTime": 1674878400000,
			"venue": "L-Block"
		},
		"Pixar": {
			"coordinators": [
				{
					"coordinator_name": "Prakhar",
					"coordinator_number": "7355386389"
				},
				{
					"coordinator_name": "Keshav",
					"coordinator_number": "9599122649"
				}
			],
			"description": "Phase 1: 12-13 April (4:30 PM to 7:30 PM) \nPhase 2: 15 April (2:00 PM to 5:00 PM)\n\nDigital Image Processing wherein one would be given the chance to explore the \nimages by using your might wherein you may be extracting info from blurred \nimages or even encrypting information inside images.\n",
			"document": "https://forms.gle/Qhb7jrSgMpjPVR9u7",
			"endTime": 1650022200000,
			"eventName": "Pixar",
			"flagship": "false",
			"poster": "https://i.ibb.co/kK4rSpd/Pixar-poster.png",
			"rules": [
				"No internet usage is allowed in both rounds.",
				"Only official documentation of OpenCV can be used as reference Material.",
				"Only one PC is allowed on-site for Phase 2.",
				"Cheating or code discussion is a serious offense and may result in  elimination."
			],
			"startTime": 1649761200000,
			"venue": "L Block"
		},
		"RoboSoccer": {
			"coordinators": [
				{
					"coordinator_name": "Ayush",
					"coordinator_number": "8860314970"
				},
				{
					"coordinator_name": "Keshav",
					"coordinator_number": "9599122649"
				}
			],
			"description": "Robo-Soccer is a robotics-based sports event where teams control the bots   \nmanually and play soccer.\n",
			"document": "https://forms.gle/3BA3LSbXcD2rRU3s9",
			"endTime": 1650180600000,
			"eventName": "RoboSoccer",
			"flagship": "true",
			"poster": "https://i.ibb.co/CVb0y3C/robo-soccer.png",
			"rules": [
				"Each round will last for 7 minutes.",
				"If the power source is wired it must not tangle the other robot otherwise it will incur a penalty. ",
				"The bot must not be using any weapons or anything that can harm either the other bot or the arena itself.",
				"No trapping mechanisms to hold/trap the ball are allowed.",
				"The potential difference between any 2 points must not exceed 12V. ",
				"The total weight of the robot in the arena must not exceed 3KGs. ",
				"The bot dimension must not exceed 400mm*200mm*150mm. "
			],
			"startTime": 1650166200000,
			"venue": " AE Lawns"
		},
		"Simulator": {
			"coordinators": [
				{
					"coordinator_name": "Sparsh",
					"coordinator_number": "8383071758"
				},
				{
					"coordinator_name": "Shubham",
					"coordinator_number": "8950113509"
				}
			],
			"description": "Phase 1: 11-12 April (4:30 PM to 7:30 PM) \nPhase 2: 16 April (2:00 PM to 5:00 PM)\n\nSimulator is an electronics circuit design and Simulation event that will test your       \nknowledge of core electronics and their real-life applications.\n",
			"document": "https://forms.gle/sfdLbsPubQytDRur9",
			"endTime": 1650108600000,
			"eventName": "Simulator",
			"flagship": "false",
			"poster": "https://i.ibb.co/Kh1z06x/Simulator-poster.png",
			"rules": [
				"For Round 1:",
				"A 40 mins window will be allocated for each team to complete the test. Both the team members have to give the test together.",
				"The test will have both subjective and objective questions.",
				"Usage of the Internet is not allowed.",
				"The top 6 teams will qualify for the final round from 1st year and 2nd,3rd years separately.",
				"Any act of misbehaving or misconduct will directly lead to disqualification of the team.",
				"For round 2:",
				"Two problem statements will be provided in this round, that needs to be completed in an hour’s time",
				"For second and third-year students, each of these problems has to be simulated in Proteus only. Please make sure that you have all the libraries installed in accordance with the instructions given in the readme.",
				"First-year students will have to use TinkerCad, an online simulation tool available for free.",
				"Scores will be given on the basis of problem weightage and the accuracy of your simulation results. The team with the maximum score will be declared the winner.",
				"In the case of a tie, the team that took the least amount of time will be the winner.",
				"Usage of the Internet is not allowed.",
				"Any act of misbehaving or misconduct will directly lead to disqualification of the team."
			],
			"startTime": 1649674800000,
			"venue": "L Block"
		},
		"WAR-O-BOTS": {
			"coordinators": [
				{
					"coordinator_name": "Satwik",
					"coordinator_number": "9015554127"
				},
				{
					"coordinator_name": "Tanuj",
					"coordinator_number": "7982420561"
				},
				{
					"coordinator_name": "JP",
					"coordinator_number": "8179293004"
				},
				{
					"coordinator_name": "CV Sai Teja ",
					"coordinator_number": "9121780873"
				}
			],
			"description": "ROUND 1:\n• One robot has to fight other robots in a war and has to push the other robot out of the arena within a 5 min period.\n• It is an elimination round and only the winners will proceed further.\nROUND 2:\n• The winners of the initial round will be arranged in a group of three and a battle for 5 min time will take place between them.\n• Weapons are allowed in this round and one should not clip the power supply wires of opponent robots.\n• In case of a deadlock situation, the deciding criteria will be the points (awarded based on weapon usage and other criteria).\n",
			"document": "https://raw.githubusercontent.com/descifrador17/microbus_nitkkr/main/war-o-bots.pdf",
			"endTime": 1650011400000,
			"eventName": "WAR-O-BOTS",
			"flagship": "false",
			"poster": "https://res.cloudinary.com/techspardha-live/image/upload/v1649531295/techspardha/events/war-o-bots_kwbncu.png",
			"rules": [
				"ABSTRACT:  Weapon supply and the power supply should be explained in detail with the help of a diagram (if required), the subject of the abstract should be WAR-O-BOTS_(team name) and also mention the contact details and it should be mailed to: tanuj_11815126@nitkkr.ac.in",
				"ROBOT SPECIFICATIONS: The dimensions and The weight (including weapons) must not exceed 400mm X 400mm X 400mm and 10 kg respectively. Control can be wired or wireless. Power supply should not exceed 24V between any two points on the robot and Jumping, hopping and flying are not allowed.",
				"WEAPON SPECIFICATIONS:  Any kind of cutter, flipper, saws, lifter, spinners, hammers etc. are allowed and any type of projectile or inflammable weapons are not allowed also the weapons should not destroy the arena in any way."
			],
			"startTime": 1650000600000,
			"venue": "AE Lawn"
		}
	}
}
